console.log('Вёрстка валидная 10/10 \n Вёрстка семантическая 16/16 \n Вёрстка соответствует макету 54/54 \n Общие требования к верстке 20/20 \n проверено вручную и в perfectPixel ' );

console.log('блок Header +2 \n секция welcome +2 \n секция about +4 \n секция Favorites +4 \n секция CoffeShop +4 \n секция Contacts +4 \n секция LibraryCard +4 \n блок <footer> + 2 \n Ни на одном из разрешений до 640px включительно не появляется горизонтальная полоса прокрутки. Весь контент страницы при этом сохраняется: не обрезается и не удаляется +12 \nНа ширине экрана 768рх реализовано адаптивное меню +12 ')

console.log("200/200")